export const Transliterate = (word) => {
  let res =''
  const letters = {
    'А':'A', "а":"a", "Б":"B", "б":"b", 'В':"V", "в":'v', "Г":'H', "г":"h", "Ґ":'G', 'ґ':'g', 'Д':"D", "д":"d", 'Е':'e', 'е':'e',
    'Є':'Ye', 'є':'ye', "Ж":'Zh', 'ж':"zh", 'З':"Z", 'з':"z", "И":'Y', 'и':"y", 'І':"I", 'і':'i', 'Ї':'yi', 'ї':'yi', 'Й':'Y', 'й':'y', 'К':'K', 'к':'k', 'Л':'L', 'л':'l',
    'М':'M', 'м':'m', 'Н':'N', 'н':'n', 'О':'O', 'о':'o', 'П':'P', 'п':'p', 'С':'S', 'с':'s', 'Т':'T', 'т':'t', 'У':'U', 'у':'u', 'Ф':'F', 'ф':'f', 'Х':'Kh', 'х':'kh',
    'Ц':'C', 'ц':'c', 'Ч':'Ch', 'ч':'ch', 'Ш':'Sh', 'ш':'sh', 'Щ':'Shch', 'щ':'shch', 'ь':"", 'Ю':'Yu', 'ю':'yu', 'Я':'Ya', 'я':'ya', "Р":'R','р':'r'
  }

  for (let i = 0; i < word.length; i++) {
    if (word[i] in letters){
      res += letters[word[i]]
    }
    else res += word[i];
  }

  return res;
}